Repository: 84000/data-translation-memory
Catalog: toh159-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཚངས་པས་བྱིན་གྱིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Questions of Brahmadatta

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་ཐམས་ཅད་ཀྱང་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པ་ཐོབ་པ། གཟུངས་ཐོབ་པ།
en: The Blessed One was residing in the Jeta Grove, Anāthapiṇḍada’s park in Śrāvastī, together with a great assembly of two hundred fifty thousand monks and a large number of bodhisattva great beings.

source: ཏིང་ངེ་འཛིན་ཐོབ་པ། ཆགས་པ་མེད་པའི་གཟུངས་ཐོབ་པ། སྒོ་མཐའ་ཡས་པའི་ཕྱག་རྒྱ་བསྒྲུབ་པའི་གཟུངས་ལ་མཁས་པ། སྟོང་པ་ཉིད་ལ་གནས་པ། མཚན་མ་མེད་པའི་སྤྱོད་ཡུལ་བ་མ་བརྟགས་པའི་སྨོན་ལམ་ཅན།
en: All of these were bodhisattvas who were versed in extraordinary knowledge, had acquired extraordinary knowledge along with dhāraṇī, samādhi, and unimpeded dhāraṇī, and were skilled in the dhāraṇīs that accomplish the seal of infinite gateways. They dwelled in emptiness, they had the experience of signlessness, and they had aspirations that were not imputed.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཤ་སྟག་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: They all had reached the acceptance that phenomena are unarisen.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་བསྐོར་བ་བྱས་ནས།
en: Then, the bodhisattva Amoghadarśin, together with about five hundred bodhisattvas, prostrated at the feet of the Blessed One, circumambulated him, and departed.

source: མཐར་གྱིས་ལྗོངས་རྒྱུ་ཞིང་སོང་བ་ལས་ལྔ་འཛིན་གྱི་ལྗོངས་སུ་ཕྱིན་ཏོ།
en: After traveling through several towns, they finally arrived in the region of Pañcāla.

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་བདག་གི་ཡུལ་འདིར་ཕྱིན་ཏོ་ཞེས་ཐོས་ནས་དེ་ཚིམ་ཞིང་མགུལ་ཡི་རངས་ཏེ།
en: When King Brahmadatta learned of the bodhisattva Amoghadarśin’s arrival in his land, he felt pleased and happy, and he rejoiced.

source: རབ་ཏུ་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་སྐྱེ་བོའི་ཚོགས་མང་པོས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས།
en: Overjoyed and content, he led a large following of people to the place where the bodhisattva Amoghadarśin was staying.

source: བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: When he arrived there, he prostrated by touching his head to the bodhisattva Amoghadarśin’s feet, then sat to one side.

source: །སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས།
en: His many followers also prostrated by touching their heads to the bodhisattva Amoghadarśin’s feet, then sat to one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐོང་བ་དོན་ཡོད་ཀྱིས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གཡོག་འཁོར་དང་བཅས་པ་འཁོད་པར་རིག་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ཆོས་ལྔ་དང་ལྡན་པ་ནི་འཁོར་བ་ན་འཁོར་བའི་ཚེ་རྟག་ཏུ་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་ལ། མི་ཁོམ་པ་རྣམས་སུ་ཡང་སྐྱེ་བར་མི་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དང་ཡང་ཕྲད་ཅིང་མཉེས་པར་བྱེད་པར་འགྱུར་རོ།
en: When he saw that King Brahmadatta and his assembled retinue and attendants were present, the bodhisattva Amoghadarśin said to him, “Great King, an anointed king of royal descent who possesses five attributes will continuously progress while traversing saṃsāra and will never take birth in unfavorable states. He will also meet and please thus-gone ones.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཆོས་སྟོན་པ་ན་ཡང་ལྡེམ་པོའི་ངག་ལ་མཁས་པར་འགྱུར་རོ།
en: When the blessed buddhas teach the Dharma, he will also master their allegorical speech.

source: །དྲན་པ་མི་ཆོད་པ་དང་ལྡན་པར་འགྱུར། མཛེས་པར་ཡང་འགྱུར། དབང་པོ་མ་ཚང་བར་མི་འགྱུར།
en: He will maintain uninterrupted mindfulness, look attractive, and not lack any sense faculty.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་དོན་དམ་པ་དང་ལྡན་པའི་གཏམ་འདི་ལྟ་སྟེ།
en: The blessed buddhas will also speak to him with words of absolute truth;

source: བདེན་པ་བཞི་བསྟན་པ་དང་ལྡན་པས་བོད་པར་འགྱུར་ཏེ།
en: that is to say, they will demonstrate the four truths.

source: ལྔ་གང་ཞེ་ན།
en: “What are these five attributes?

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་དད་པ་ཅན་ཡིན་ཏེ།
en: “Great King, an anointed king of royal descent possesses faith.

source: དད་པའི་ཤས་ཆེ་ཞིང་ཞེ་འགྲས་པ་མེད་པའི་ཡིད་དང་ལྡན་ནོ།
en: He possesses a mind that is strong in faith and is without animosity.

source: །དེའི་དད་པ་དེ་ཡང་ངེས་པར་རྩ་ཟུག་ཏུ་བསྟན་པ་ཡིན་ནོ།
en: His faith is also demonstrated to be rooted in certainty.

source: །དད་པ་དེ་ཡང་རྣམ་པ་བཅུར་བལྟ་བར་བྱ་སྟེ།
en: His faith should furthermore be observed in ten ways.

source: བཅུ་གང་ཞེ་ན།
en: What are these ten?

source: འདི་ལྟ་སྟེ།
en: They are as follows: (1) He gives without deceit.

source: གཡོ་མེད་པར་སྦྱིན་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། ལྷག་པའི་ང་རྒྱལ་མེད་པ་དང་། དང་བའི་ཤས་ཆེ་བ་དང་། འཕགས་པའི་བསྟན་པ་ལ་སྐྱོན་དུ་མི་འཛིན་པ་དང་། དགེ་སློང་རབ་འབྲིང་ཐ་མ་རྣམས་ལ་འཁྲུལ་པ་མི་ཚོལ་བ་དང་། སྟོང་པ་ཉིད་ལ་མོས་པ་དང་། ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པ་དང་། ངག་གི་ལས་ཡོངས་སུ་དག་པ་དང་། ཡིད་ཀྱི་ལས་ཡོངས་སུ་དག་པ་སྟེ་བཅུ་པོ་དེ་དག་ཡིན་ནོ།
en: He gives away all possessions completely. (3) He has no excessive pride. (4) He has exceptional clarity. (5) He does not apprehend any fault in the teachings of the noble ones. (6) He does not investigate the best, intermediate, or lesser monks for mistakes. (7) He believes in emptiness. (8) His physical actions are pure. (9) His verbal actions are pure.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་དང་པོ་འདི་དང་ལྡན་པའི་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་དག་ཐོབ་པར་འགྱུར་རོ།
en: His mental activity is pure. “Great King, one of royal descent who possesses this first attribute and is an anointed king accomplishes these qualities just mentioned.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་ཆོས་འདོད་པ་ཡིན་ཏེ།
en: “Moreover, Great King, an anointed king of royal descent longs for the Dharma.

source: རྒྱུན་མི་ཆད་པར་འཕགས་པ་རྣམས་མཐོང་བར་འདོད་པ་དང་། ཐོས་པ་ཚོལ་བ་ལ་ཆོག་མི་ཤེས་སོ།
en: He always yearns to behold the noble ones, and he insatiably seeks to hear the Dharma.

source: །དེའི་མང་དུ་ཐོས་པ་དེ་ཡང་སེམས་ཀྱིས་ཤིན་ཏུ་བརྟགས་པ་དང་། མཐོང་བས་ཤིན་ཏུ་རྟོགས་པ་ཡིན་ནོ།
en: Using his mind he carefully investigates the many things he has learned, and then fully realizes them through experience.

source: །རྒྱལ་པོ་ཆེན་པོ་ཡན་ལག་བཅུ་དང་ལྡན་ན་ཆོས་དང་ལྡན་པའི་རྒྱལ་པོར་རིག་པར་བྱ་སྟེ།
en: Great King, a king should be understood to be endowed with the Dharma if he has ten qualities.

source: ཆོས་འདོད་པས་ལུས་ལ་མི་ལྟ་ཞིང་སྲོག་ལ་མི་ལྟ་བ་དང་། འཁོར་བ་ལ་སྐྱོ་བའི་ཡིད་དང་ལྡན་པ་དང་། ཁྱིམ་ན་གནས་པ་ལ་སྐྱོན་མང་བར་སེམས་པ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བའི་ཡིད་དང་ལྡན་པ་དང་། སྔོན་མངོན་པར་འདུས་བྱས་པའི་ལས་ཀྱི་ནང་ནས་སྡིག་པའི་ལས་ལ་སྨོད་ཅིང་མ་འོངས་པ་མངོན་པར་འདུ་མི་བྱེད་པ་དང་། སྡུག་པ་དང་མི་སྡུག་པ་རྣམས་ལ་ངེས་པར་སེམས་པའི་ཡིད་དང་ལྡན་པ་དང་། བསམ་པ་ཐག་པ་ནས་བསྒྲུབས་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྫོགས་པར་བྱེད་དེ།
en: He is without concern for his body or life in his quest for the Dharma. (2) He possesses a mindset that is weary of saṃsāra. (3) He thinks that a householder’s life entails too many faults. (4) He has a mindset that is not concerned with material things. (5) He is critical toward the negative actions that stem from his previous karma, and he does not create future formations. (6) He possesses a mindset that discriminates between all that is attractive and all that is repulsive.

source: ཚིག་ལྷུར་ལེན་པར་མི་བྱེད་པ་དང་། ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་བས་དམ་བཅས་པ་ལ་བརྟན་པ་དང་། རང་གི་གཡོག་འཁོར་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་།
en: Mastering his intent, he perfects the conduct of a bodhisattva and does not privilege words. (8) He is steadfast in his commitments because he seeks wisdom.

source: རྒྱུན་མི་ཆད་པར་དེ་དག་ཆོས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་སྨིན་པར་བྱེད་ལ།
en: He fosters awakening in his servants and retinue and completely matures them continuously with the gift of the Dharma.

source: དེ་དག་གི་ཟང་ཟིང་ཡང་སྡུད་པར་བྱེད་པ་སྟེ།
en: He also fulfills their material needs.

source: བཅུ་པོ་དེ་དག་ཡིན་ནོ། །རྒྱལ་པོ་ཆེན་པོ་ཆོས་གཉིས་པོ་འདི་དང་ལྡན་པའི་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི། ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་དག་ཐོབ་པར་འགྱུར་རོ།
en: “Great King, one of royal descent who possesses this second attribute and is an anointed king accomplishes these qualities just mentioned.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་ཆོས་ཟབ་མོའི་བཟོད་པ་ལ་མོས་ཤིང་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་སྒྲུབ་པ་ཐོབ་པ་ཡིན་ནོ།
en: “Moreover, Great King, an anointed king of royal descent believes in accepting the profound Dharma and accomplishes the samādhi of emptiness.

source: །དེའི་ཟབ་མོ་ལ་མོས་པ་དེ་ཡང་རྣམ་པ་བཅུར་རིག་པར་བྱའོ།
en: His interest in the profundity of the Dharma should also be understood in ten ways.

source: །བཅུ་གང་ཞེ་ན།
en: What are these ten?

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་། དགེ་བའི་ཆོས་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལས་ཤས་ཆེར་གུས་པ་དྲག་པོ་དང་ལྡན་ཞིང་ཡ་ང་བའི་ལས་མངོན་པར་འདུ་བྱེད་པ་ཡང་ཡོངས་སུ་སྤོང་བ་དང་། མངོན་པར་འདུ་བྱེད་པ་ཡིད་དུ་འོང་བ་ཡང་མངོན་པར་འདུ་བྱེད་པ་དང་། སྐྱེ་བོ་དབང་ཕྱུག་དང་ལྡན་པ་རྣམས་ལ་ཡང་གཟུ་ལུམས་སུ་ནན་གྱིས་གནོན་པར་མི་བྱེད་པ་དང་། ཡིད་དུ་འོང་བའི་སྦྱིན་པ་ཡང་གཞན་དག་ལ་སྟོབས་པར་བྱེད་དེ།
en: His actions accord with his words. (2) He completes all his virtuous Dharma activities with very strong devotion and rids himself of the formations of unpleasant actions. (3) He creates pleasing formations. (4) He does not unjustly suppress individuals who possess power and riches. (5) He provides others with pleasing gifts and eliminates all that is not pleasant.

source: ཡིད་དུ་མི་འོང་བ་ཡོངས་སུ་སྤོང་བ་དང་། ཆོས་ཐམས་ཅད་ལ་ཡང་སྟོང་ངོ་སྙམ་དུ་ངེས་པར་འབྱུང་བར་བྱེད་པ་དང་། བྱེད་པ་མེད་པའི་ལྟ་བས་ཡང་དག་པའི་མཐའ་ལ་མཚན་ཉིད་གཅིག་ཏུ་མོས་པར་ཡང་མི་བྱེད་ལ་ཐ་དད་པའི་འདུ་ཤེས་ཅན་ཡང་མ་ཡིན་པ་དང་། རང་གི་ཡོན་ཏན་གྱིས་ཀྱང་གཞན་གྱི་ཡོན་ཏན་ཁྱད་དུ་གསོད་པར་མི་བྱེད་པ་དང་། ཚད་ངེས་པར་འཛིན་པ་ཡང་མི་བྱེད་པ་དང་། གང་ཟག་སྦྱོར་བ་མེད་པ་རྣམས་ལ་ཡང་ཆོས་ཀྱི་དབྱིངས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། འཐུན་པར་བྱེད་པ་སྟེ་བཅུ་པོ་དེ་དག་ཡིན་ནོ།
en: Thinking that all phenomena are empty, he cultivates renunciation. (7) His view is free of contrivance, thus he neither believes in the singularity of the limit of reality nor holds concepts of its multiplicity. (8) He does not use his own qualities to belittle the qualities of others. (9) He does not form definite judgments. (10) He brings those who do not practice into alignment with the inconceivable realm of phenomena.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་གསུམ་པོ་འདི་དང་ལྡན་པའི་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་དག་ཐོབ་པར་འགྱུར་རོ།
en: “Great King, one of royal descent who possesses this third attribute and is an anointed king accomplishes these qualities just mentioned.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་འཇིག་རྟེན་གནས་པའི་གནོད་པས་སྦགས་པས་སྦགས་པར་ཡང་དག་པར་མཐོང་བ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པའི་ཕྱིར་བསྟན་པ་ཡོངས་སུ་འཛིན་པ་ལ་འཇུག་སྟེ།
en: “Moreover, Great King, when an anointed king of royal descent clearly perceives the contamination that comes from the harm of living in this world, he upholds the teachings for the sake of accomplishing unsurpassed, complete, and perfect awakening.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་སྟོབས་བསྐྱེད་པ་ལ་བརྩོན་ཤིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡོངས་སུ་མི་སྐྱོའོ།
en: He perseveres in generating the power of the six perfections and never tires of fully maturing sentient beings.

source: །དེའི་བསྟན་པ་ཡོངས་སུ་འཛིན་པ་དེ་ཡང་རྣམ་པ་བཅུར་རིག་པར་བྱ་སྟེ།
en: Furthermore, the ways in which he upholds the teachings should be understood in ten ways.

source: འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མི་ཚུགས་པའི་ཏིང་ངེ་འཛིན་སྒྲུབ་པ་ལ་བརྩོན་པ་དང་། གཟུངས་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་རྣམ་པར་ངེས་པ་ལ་མཁས་པ་དང་། གང་ཟག་གང་དག་མངོན་པར་བརྩོན་པ་དེ་དག་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། སྟན་དང་། ནད་ཀྱི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་བསྟབས་པས་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་ལ་བརྩོན་པ་དང་། ལེགས་པར་བསམས་པ་སེམས་པ་དང་། ལེགས་པར་སྨྲ་བས་སྨྲ་བ་དང་། ལེགས་པའི་ལས་བྱེད་པ་དང་། རབ་ཏུ་འབྱུང་བར་སེམས་པ་དང་། རྒྱལ་པོ་ལ་དགའ་བ་ལ་སྐྱོན་དུ་རྟོག་པ་དང་། གཟུགས་སྡུག་ཅིང་གཟུགས་བཟང་བ་ཐམས་ཅད་ལ་མི་ལྟ་བའི་ཡིད་དང་ལྡན་པ་དང་། ཐ་ན་རྒྱལ་པོ་གཅིག་པུར་སྲེད་པས་བསྒྲུབ་པ་ལ་ཡང་མི་ལྟ་བའི་ཡིད་དང་ལྡན་པ་སྟེ།
en: He perseveres in attaining samādhi that is unimpeded by the eight worldly concerns. (2) He perseveres in seeking out the dhāraṇīs. (3) He is skilled in ascertaining so that he completely apprehends the supreme Dharma. (4) He never tires of providing various necessities to those who persevere, including clothes, food, bedding, cushions, and medicines to cure sickness. (5) He strives to encourage awakening. (6) He thinks excellent thoughts, speaks excellent words, and performs excellent deeds. (7) He is inclined towards renunciation. (8) He thinks that it is a mistake to delight in being a king. (9) He possesses a mindset that has no concern for any beautiful or pleasant forms. (10) At the very least he does not think that anything is accomplished by only craving kingship.

source: བཅུ་པོ་འདི་དག་ཡིན་ནོ། །རྒྱལ་པོ་ཆེན་པོ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་པའི་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་དེ་དག་ཐོབ་པར་འགྱུར་རོ།
en: “Great King, one of royal descent who possesses this fourth attribute and is an anointed king accomplishes these qualities just mentioned.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་གང་ཟག་གང་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱིས་ཡང་དག་པར་བསྒྲུབ་པ་འདི་འཛིན་པ་དང་། ཀློག་པ་དང་། སྟོན་པ་དེ་དག་ལ་ཆོས་བཞིན་དུ་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྦེད་པར་བྱེད་ལ་སེམས་ཅན་གང་དག་གང་ཟག་དེ་ལྟ་བུ་དག་ལ་གནོད་པ་བྱེད་པའི་རང་བཞིན་ཅན་གྱི་གང་ཟག་དེ་ལྟ་བུ་དེ་དག་ལ་ནི་འདི་ལྟར་ཆོས་ཀྱི་ལོངས་སྤྱོད་འདི་ལ་སྤྱོད་པ་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་ཆད་པས་གཅོད་པར་བྱེད་དོ།
en: “Moreover, Great King, an anointed king of royal descent follows the Dharma in guarding, protecting, and shielding those who uphold, read, and teach unsurpassed, complete, and perfect awakening, which one fully accomplishes in a hundred billion trillion incalculable eons. He likewise punishes beings who are harmful to such individuals in order to completely protect the enjoyment of this resource of Dharma.

source: །དེའི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དེ་ཡང་རྣམ་པ་བཅུར་རིག་པར་བྱ་སྟེ།
en: His effort to completely uphold the supreme Dharma should also be understood in ten ways.

source: ཡང་དག་པར་བསྒྲུབ་པ་དང་། ངེས་པར་ཕངས་པར་བྱེད་པ་དང་། ཆོས་ལ་མོས་པ་དང་། འཁྲུལ་པ་མེད་པར་ཀུན་ཏུ་སྤྱོད་པ་དང་། ཡེ་ཤེས་འདོད་ཅིང་ཡོན་ཏན་གྱི་ཁྱད་པར་ལ་ཡིད་ཆེས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཕོ་ཉ་དང་། ཉེ་བར་སྤྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་སྣོད་དུ་རུང་བ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་སྡུད་པ་དང་། དམ་པའི་ཆོས་འབར་བར་བྱེད་པ་དང་། སྐྱེ་བོ་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: He desires wisdom and has trust in distinctions of enlightened qualities. (6) He acts as a messenger of the Thus-Gone One. (7) He is a suitable vessel for buddhahood. (8) He holds together the lineage of the Three Jewels. (9) He causes the supreme Dharma to blaze brightly. (10) He completely matures many people.

source: བཅུ་པོ་དེ་དག་ཡིན་ནོ། །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ལྔ་པོ་འདི་དང་ལྡན་པའི་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་ནི་ཇི་སྐད་སྨོས་པའི་ཡོན་ཏན་འདི་དག་ཐོབ་པར་འགྱུར་རོ།
en: “Great King, one of royal descent who possesses this fifth attribute and is an anointed king accomplishes these qualities just mentioned.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྐད་སྨྲས་སོ།
en: After this, the bodhisattva Amoghadarśin recited the following verses: “The king who always has a sincere attitude

source: །རྒྱལ་པོ་སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་ལ། །རྟག་ཏུ་ལྷག་པའི་བསམ་པ་གཡོ་མེད་པས།
en: Toward the Buddha, Dharma, and Saṅgha

source: །དད་པ་དང་ནི་དང་བ་མི་ཕྱེད་པ།
en: Has indestructible faith and confidence

source: །དེ་ལ་ཡོན་ཏན་འདི་དག་དཀོན་པ་མེད།
en: And never lacks the following qualities.

source: །བཅོས་མ་མ་ཡིན་ཤེས་ནས་དད་པ་སྐྱེས།
en: “His faith is not contrived but is born from understanding,

source: །དེ་ལ་དངོས་པོ་ཅི་ཡོད་སྲི་བ་མེད།
en: And he does not hang on to anything he owns.

source: །བྱིན་ནས་ཀྱང་ནི་དེ་ལ་འགྱོད་པ་མེད།
en: Rather, he feels no regret when it is given away.

source: །འདིར་ནི་ཡོན་ཏན་དེ་དག་དད་པའི་མཚན།
en: These qualities are a sign of faith.

source: །དེ་དག་བསམ་པ་རྟག་ཏུ་རྙོག་པ་མེད།
en: “Those whose thoughts are always unsullied

source: །མི་ཕྱེད་རི་རབ་བཞིན་དུ་སྐྱོད་དུ་མེད།
en: Are unshakable like the indestructible Mount Meru.

source: །བུམ་པ་གང་བ་ལེགས་གནས་མི་གཡོ་ལྟར།
en: Just as a full vase does not move when it is well placed,

source: །དེ་དག་དད་པ་ཤིན་ཏུ་གཡོ་མེད་པ།
en: Their faith is absolutely unmoving.

source: །མཐོང་ལ་མ་མཐོང་ཐོས་ལ་མ་ཐོས་པ།
en: “Those who see without seeing and hear without hearing

source: །གང་དག་རི་བཞིན་དུ་ནི་གཡོ་བ་མེད།
en: Are immovable like a mountain.

source: །དེ་དག་ལྟ་བུ་དད་པའི་མཚན་ཉིད་དེ།
en: Such are the characteristics of faith,

source: །གནས་རྣམས་ཀུན་ཏུ་ནམས་ཀྱང་འགྱུར་བ་མེད།
en: Which will not change at all in any situation.

source: །ཞི་བ་འདོད་ཕྱིར་ཆོས་འདོད་གང་ཡིན་པ།
en: “Wise ones who wish for the Dharma because they wish for peace Should abandon everything else for the sake of the Dharma

source: །མཁས་པ་དེས་ནི་ཆོས་དོན་ཀུན་སྤོངས་ཤིག །དེ་སྤངས་ནས་ཀྱང་དེ་ལ་སེམས་པ་མེད།
en: And, after abandoning everything, should not think of it.

source: །དེ་དག་ཆོས་འདོད་རྣམས་ཀྱི་མཚན་ཉིད་དོ།
en: These are the characteristics of those who wish for the Dharma.

source: །སྐྱེ་བོའི་བདག་པོ་གང་ཞིག་ཆོས་འདོད་པ།
en: “When a lord of humans who wishes for the Dharma

source: །གང་ཚེ་ལེགས་པར་གསུངས་པ་མི་ཉན་པ།
en: Does not listen to the eloquent teachings,

source: །ས་བོན་རུལ་པ་ཞིང་ངན་བཏབ་པ་ལྟར།
en: Like a rotten seed sown in a bad field,

source: །འདྲེན་པའི་བསྟན་པ་དག་ལ་སྐྱེ་མི་འགྱུར།
en: The pure instructions of the Leader of Beings will not grow.

source: །ཐོས་ཀྱང་འདི་ལ་བདག་ནི་མཁས་སྙམ་སེམས།
en: “Even if one hears them, but thinks, ‘I am wise in them,’

source: །ཆོས་རྣམས་རང་བཞིན་ཅི་འདྲ་རྟོགས་སྙམ་སྟེ།
en: Or, ‘I have realized the exact nature of all phenomena,’

source: །ལྷག་པའི་བསམ་པས་སྤྱོད་པ་མ་དག་ལ།
en: One cannot purify their conduct with a sincere attitude;

source: །གཉིས་སེམས་ལྡན་ལ་དག་པ་ག་ལས་འོང་།
en: How can one with a dualistic mind become pure?

source: །ཆོས་འདོད་གང་དག་དྲན་པའི་བློ་དང་ནི།
en: “Those who wish for the Dharma with mindfulness,

source: །གུས་བཅས་གཡོ་མེད་ལུག་ལྟར་ལྐུགས་མེད་པ།
en: Who are respectful, unwavering, not stupid like sheep,

source: །རྒྱ་མཚོ་ཆེན་པོ་བཞིན་དུ་འབབ་པ་མེད།
en: And are not like a rushing torrent but like a still ocean—

source: །དེ་འདྲ་དེ་དག་བྱང་ཆུབ་མཆོག་གི་སྣོད།
en: Such are vessels for supreme awakening.

source: །ཆོས་འདོད་པ་ནི་ནང་དང་ཕྱི་རོལ་གྱི།
en: “Those who wish for the Dharma

source: །དངོས་པོ་ཀུན་ལ་སྡུག་འཛིན་ཅི་ཡང་མེད།
en: Never cling to any outer or inner things.

source: །ཤེས་པ་རྣམས་ལ་ཕངས་ཤིང་བྱིས་པས་སྨད།
en: They are cherished by the knowledgeable and criticized by fools.

source: །འདིས་ནི་ཆོས་འདོད་གང་ཡིན་ཤེས་པར་བྱ།
en: These are the ways to recognize people who wish for the Dharma.

source: །དེ་ཡི་ཕྱིར་ན་རྒྱལ་པོ་ཆོས་འདོད་པ།
en: “Therefore, as a king who wishes for the Dharma,

source: །འདི་ཐོས་ནས་ནི་བསྒྲུབ་པ་དག་པ་ཡིས།
en: Practice purely after hearing these words,

source: །སྨྲས་པ་ཙམ་དང་ཐོས་ལ་གནས་མ་བྱེད།
en: And don't fixate on mere words or studies;

source: །བསམ་པ་ཉམས་པ་ལ་ནི་ཤེས་རབ་མེད།
en: There is no wisdom in degenerate thoughts.

source: །ཟབ་མོ་བཟོད་ལ་མོས་པ་གང་ཡིན་དེ།
en: “Those who believe in the acceptance of the profound

source: །སྡུག་དང་མི་སྡུག་རྣམས་ལ་ཆགས་པ་མེད།
en: Do not cling to pleasant or unpleasant forms.

source: །དེ་དག་རླུང་ལྟར་ཆགས་པ་མེད་པ་ཡང་།
en: Just like the wind, they have no attachment,

source: །བསྐལ་པ་བརྒྱ་གྲངས་མཐའ་ཡས་སྤྱོད་པར་འགྱུར།
en: Yet they practice for hundreds of infinite eons.

source: །རྒྱལ་པོ་གལ་ཏེ་བྱང་ཆུབ་ཁྱོད་འདོད་ན།
en: “King, if awakening is what you wish for,

source: །ལྷག་པའི་བསམ་པས་བསམ་པ་སྦྱང་བར་གྱིས། །བདག་དང་བདག་གི་སྙམ་པའི་ང་རྒྱལ་གྱིས།
en: Purify your thoughts with a sincere attitude.

source: །གནས་འདིར་ཕྱིན་ཅི་ལོག་ཏུ་གནས་མ་བྱེད།
en: Do not remain in this mistaken state Because of prideful thoughts of ‘I’ and ‘mine.’

source: །ཁྱོད་ཀྱིས་ཉེས་པ་རྟག་ཏུ་བཤགས་པར་གྱིས།
en: “You should continuously confess faults.

source: །ཁྱོད་ནི་འཐུན་པའི་སྡོམ་ལ་གནས་པར་གྱིས།
en: You should maintain favorable vows.

source: །དབང་ཕྱུག་དང་ནི་གཉེན་ལ་མི་རྟག་སོམས།
en: Regard power and relationships as impermanent.

source: །རྟེན་པ་མེད་པ་འདི་ནི་ཡང་དག་སྟོང་།
en: This absence of support is genuine emptiness.

source: །སྟོང་པའི་ཆོས་རྣམས་མང་པོ་ཇི་སྙེད་སྨྲ།
en: “However many teachings on emptiness you preach,

source: །སྟོང་ཉིད་ཇི་བཞིན་དེ་ལ་གནས་པ་མིན།
en: This is not abiding in emptiness just as it is.

source: །ཆོས་ཉིད་ལས་ནི་གང་གིས་འགལ་བྱས་པ།
en: Anyone who acts contrary to reality

source: །དེ་ནི་ཟབ་མོའི་ཚུལ་ལ་བཟོད་པ་མིན།
en: Does not accept the profound way.

source: །དེ་ཕྱིར་སྟོང་པ་འདི་ནི་ཀུན་ཏུ་འགལ།
en: “Thus, this emptiness is totally wrong.

source: །སྟོང་ཉིད་ཇི་བཞིན་དེ་ནི་གང་གིས་ཤེས།
en: One who knows emptiness just as it is Will escape the worldly realm and reach supreme awakening

source: །དེ་ནི་ངང་པའི་རྒྱལ་པོས་རྫབ་སྤངས་བཞིན།
en: Like the king of geese leaving a swamp.

source: །ཁམས་ལས་ངེས་བྱུང་བྱང་ཆུབ་མཆོག་ལ་རེག །དེ་བཞིན་གཤེགས་ལ་གུས་པར་བྱས་ནས་ཀྱང་།
en: “After generating respect for the Thus-Gone One,

source: །རྒྱལ་པོ་ཁྱོད་ཀྱིས་བསྟན་པ་བརྟག་པར་གྱིས།
en: King, you should examine what he has taught.

source: །རྒྱལ་པོ་ལུས་ནི་རབ་ཏུ་འཇིག་པའི་ཕྱིར།
en: King, because the body is going to fall apart completely,

source: །བྱང་ཆུབ་ཐེག་པ་ལ་ནི་ཡི་མ་འཆད། །སྟོན་པའི་བསྟན་བཅོས་སྤྱོད་ཡུལ་ཆོ་ག་ཤེས།
en: Do not get discouraged on the vehicle to awakening.

source: །མཁས་པ་དེ་དག་ལ་ནི་རྟག་ཏུ་བསྲུང་།
en: “You should always protect the wise, Who know the texts, experience, and rites of the Teacher.

source: །སྨྲ་བ་ཙམ་གྱི་དབང་དུ་མ་འགྲོ་ཤིག །ནད་པ་རྒྱུན་རིང་པོར་ནི་གྱུར་ཏ་རེ།
en: Do not fall under the influence of mere words, For you will undoubtedly remain sick for a long time.

source: །གང་གིས་བསྟན་པ་འདི་ནི་ལེགས་བརྟག་པ།
en: “One who examines the teachings thoroughly

source: །དེ་ནི་དོན་དུ་བསྲུང་བའི་རྒྱུད་ལ་སྒྲིམས།
en: Should focus within in order to truly guard them.

source: །ལས་དང་ཉོན་མོངས་སྣ་ཚོགས་སྤངས་ནས་དེ།
en: Abandoning the myriad afflictions and karma,

source: །ཁྱད་པར་དུ་ནི་བྱང་ཆུབ་མཆོག་ཏུ་འགྱུར།
en: One will attain in particular the supreme awakening.

source: །ཕ་རོལ་ཕྱིན་དྲུག་འདི་ལ་ལེགས་པར་སློབས།
en: “Train well in the six perfections.

source: །དེ་ལ་བསླབ་ན་བྱང་ཆུབ་ཐོབ་པར་འགྱུར།
en: Through training in them, you will attain supreme awakening.

source: །ཇི་སྙེད་བསྟན་པ་འདི་ནི་བསྒྲུབ་པར་གྱིས།
en: Put into practice all that has been taught,

source: །ཀུན་མཁྱེན་ཆོས་རྣམས་རིང་པོ་མི་ཐོགས་འཐོབ།
en: And before long you will achieve the virtues of omniscience. “The mind that relates to objects

source: །མེ་ཏོག་ཁུ་བར་བུང་བ་མི་ཆགས་དང་། །ནམ་མཁའ་ལ་ནི་བྱ་རྗེས་མེད་པ་ལྟར།
en: Like a bee unattached to a flower's nectar Or a bird leaving no trace in the sky,

source: །ཡུལ་རྣམས་ལ་ནི་གང་སེམས་དེ་འདྲ་བ། །དེ་འདྲ་དེ་ནི་རྒྱལ་པོས་སངས་རྒྱས་འགྱུར།
en: Is a mind, O King, that reaches buddhahood. “You should follow the Dharma in protecting

source: །ཟབ་མོའི་བཟོད་དང་སྤོབས་པ་ཐོབ་ནས་འདིར།
en: Those who have found acceptance and courage for the profound

source: །སངས་རྒྱས་རྣམས་ཀྱི་མཛོད་འཛིན་གང་ཡིན་པ། །དེ་དག་ཁྱོད་ཀྱིས་ཆོས་བཞིན་བསྲུང་བར་གྱིས།
en: And hold the treasury of the buddhas.

source: །མཁས་པ་དེ་འདྲ་སྲོག་ཕྱིར་མ་བཏང་ཤིག །མཁས་པ་དེ་དག་ལ་ནི་གནོད་བྱེད་མི།
en: Never forsake such wise ones, even at the cost of your life.

source: །ཆོས་དང་མི་ལྡན་བརྩོན་པ་མང་པོ་རྣམས།
en: “There are many people, devoid of Dharma, Who strive to harm such wise ones;
